#============================================================================================================
#
#	拡張機能 - ドメイン廃止のお知らせ
#	0ch_domain_oshirase.pl
#	---------------------------------------------------------------------------
#	# errmsg.cgi用
#	1063<>bbs2ch.netドメイン廃止<>現在接続しているbbs2ch.netドメインは2017年12月26日で使えなくなります。<br>当掲示版を引き続きご利用いただくためには専ブラ等の設定の変更が必要です。<br>専ブラの板登録・ブックマーク等をfriend.ship.jpに変更してくださいますようお願い申し上げます。
#	---------------------------------------------------------------------------
#	2017.10.21 start
#	2017.11.03 11/21以降はしつこく告知したり、ついでにメッセージをちょこっと変更したり。
#	2017.11.16 ファイルからタイムスタンプをreadするのを止め、mtimeを使用するようにした。すっきり。
#
#============================================================================================================
package ZPL_domain_oshirase;

use strict;

#------------------------------------------------------------------------------------------------------------
#	コンストラクタ
#------------------------------------------------------------------------------------------------------------
sub new
{
	my $this = shift;
	my ($Config) = @_;
	my ($obj);
	
	$obj = {};
	bless $obj, $this;
	
	if (defined $Config) {
		$obj->{'PLUGINCONF'} = $Config;
		$obj->{'is0ch+'} = 1;
	}
	else {
#		$obj->{'CONFIG'} = $this->getConfig();
		$obj->{'is0ch+'} = 0;
	}
	
	return $obj;
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能名称取得
#	-------------------------------------------------------------------------------------
#	@return	名称文字列
#------------------------------------------------------------------------------------------------------------
sub getName
{
	my	$this = shift;
	return 'ドメイン廃止のお知らせ';
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能説明取得
#	-------------------------------------------------------------------------------------
#	@return	説明文字列
#------------------------------------------------------------------------------------------------------------
sub getExplanation
{
	my	$this = shift;
	return 'お知らせフッタを付けたり、bbs2ch.netから書き込めなくしたり。';
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能タイプ取得
#	-------------------------------------------------------------------------------------
#	@return	拡張機能タイプ(スレ立て:1, レス:2, read:4, index:8, 書き込み前処理:16)
#------------------------------------------------------------------------------------------------------------
sub getType
{
	my	$this = shift;
	return (16);
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能実行インタフェイス
#	-------------------------------------------------------------------------------------
#	@param	$sys	MELKOR
#	@param	$form	SAMWISE
#	@param	$type	実行タイプ
#	@return	正常終了の場合は0
#------------------------------------------------------------------------------------------------------------
sub execute
{
	my	$this = shift;
	my	($sys, $form, $type) = @_;
	
	# すでにfriend.ship.jpに接続している
	return 0 if ($ENV{'SERVER_NAME'} eq 'friend.ship.jp');
	
	if (time >= 1512054000) {		# 2017/12/01 00:00:00 以降なら
		PrintBBSError($sys, 1063);	# friend.ship.jpに移行が済んでいない人は書き込めない
	}
	
	my $footer = 'bbs2ch.netドメインは2017年12月26日で使えなくなります。 <br> 専ブラの板登録・ブックマーク等をfriend.ship.jpに変更してくださいますようお願い申し上げます。';
	
	my $path = $sys->Get('BBSPATH') . '/' . $sys->Get('BBS') . '/info/ZPL_domain_oshirase_' . $sys->Get('KEY') . '.cgi';
	
	# 2017/11/01 00:00:00 以降 ? 1日 : 3日
	my $interval = (time >= 1509462000) ? 86400 : 259200;
	
	my $lasttime = (stat $path)[9] || 0;
	if (time >= 1511190000) {	# 2017/11/21 00:00:00 以降なら、常に表示させる
		$lasttime = 0;
		$footer .= ' <br> このメッセージが表示されている方は、このままですと12月1日以降は書き込めなくなります。';
	}
	
	if (time >= $lasttime+$interval) {
		$form->Set('MESSAGE', $form->Get('MESSAGE')." <hr> $footer ");
		
		open my $fh, '>', $path;
		close $fh;
		chmod($sys->Get('PM-LOG'), $path);
	}
	
	return 0;
}

#------------------------------------------------------------------------------------------------------------
#	なんちゃってbbs.cgiエラーページ表示
#------------------------------------------------------------------------------------------------------------
sub PrintBBSError
{
	my ($Sys, $err) = @_;
	
	require './module/orald.pl';
	
	my $CGI = $Sys->Get('MainCGI');
	my $Page = $CGI->{'PAGE'};
	
	my $Error = ORALD->new;
	$Error->Load($Sys);
	$Error->Print($CGI, $Page, $err, $Sys->Get('AGENT'));
	
	$Page->Flush('', 0, 0);
	
	exit($err);
}

#============================================================================================================
#	Module END
#============================================================================================================
1;
